{
  "folder": "8",
  "total_images": 6,
  "processed_images": 6,
  "descriptions": [
    {
      "image": "1.png",
      "description": "# Depletion Load nMOS Inverter\n\nAn nMOS inverter is a fundamental building block in digital logic circuits, designed to perform the Boolean NOT operation. This specific implementation uses a depletion-mode n-channel MOSFET (nMOS) as the active load, which acts as a non-linear resistor. This is an alternative to using a simple passive resistor as a pull-up device.\n\n## Circuit Configuration\n\nThe inverter consists of two n-channel MOSFETs:\n\n1.  **Driver Transistor**: An enhancement-mode nMOS transistor whose gate is connected to the input signal `Vin`. Its purpose is to pull the output node down to the ground potential when the input is high.\n2.  **Load Transistor**: A depletion-mode nMOS transistor that is always on. It acts as a pull-up device, connecting the output node to the supply voltage `VDD`.\n\n![Circuit Diagram of a Depletion Load nMOS Inverter](images/figure_1.png)\n\n### Load Transistor Characteristics\n\nThe key feature of the load device is that its gate is connected directly to its source (the output node `Vout`). This configuration ensures that the gate-to-source voltage, `Vgs(load)`, is always 0V.\n\nFor a depletion-mode nMOS transistor, the threshold voltage `Vt(load)` is negative. The condition for the transistor to be ON is `Vgs > Vt`.\n\nSince `Vgs(load) = 0` and `Vt(load) < 0`, the condition `0 > Vt(load)` is always true. Therefore, the **load transistor always remains in the ON condition**, acting as a current source or a non-linear resistor, pulling `Vout` towards `VDD`.\n\n## Inverter Operation\n\nThe operation of the inverter can be analyzed in two states, based on the input voltage `Vin`.\n\n### Case 1: Input is Low (Logic '0')\n\nWhen the input voltage `Vin` is low (e.g., 0V, representing a logic '0'), it is below the threshold voltage of the enhancement-mode driver transistor. \n\n*   The driver nMOS transistor enters the **cutoff region** and effectively acts as an open circuit (O.C.).\n*   No current path exists from `Vout` to ground through the driver.\n*   The depletion-mode load transistor, which is always ON, pulls the output node up to the supply voltage.\n*   As a result, `Vout = VDD`, which corresponds to a logic 'high' output.\n\n![Simplified model for Vin = 0](images/figure_2.png)\n\n### Case 2: Input is High (Logic '1')\n\nWhen the input voltage `Vin` is high (e.g., `VDD`, representing a logic '1'), it is well above the threshold voltage of the driver transistor.\n\n*   The driver nMOS transistor turns **ON**, creating a low-resistance path from the output node `Vout` to ground.\n*   Both the load and driver transistors are now conducting. A voltage divider is formed between the non-linear resistance of the load transistor and the on-resistance of the driver transistor.\n*   By design, the on-resistance of the driver is much smaller than that of the load. Consequently, the driver transistor pulls the output voltage `Vout` very close to ground potential.\n*   As a result, `Vout ≈ 0V`, which corresponds to a logic 'low' output.\n\n![Simplified model for Vin = 1](images/figure_3.png)"
    },
    {
      "image": "2.png",
      "description": "# Voltage Transfer Characteristic (VTC)\n\nThe Voltage Transfer Characteristic (VTC) is a fundamental graph used in digital electronics to describe the input-output behavior of a logic gate, such as an inverter. It plots the output voltage (`Vout`) as a function of the input voltage (`Vin`). The VTC provides crucial information about a gate's switching threshold, noise margins, and the operating regions of its internal transistors.\n\n![Voltage Transfer Characteristic curve for a CMOS inverter](images/figure_1.png)\n\n## Key Parameters of the VTC Curve\n\n*   **VOH (Output High Voltage):** The maximum voltage level at the output when the input represents a logic low. For a standard CMOS inverter, `VOH` is equal to the supply voltage `VDD`.\n*   **VOL (Output Low Voltage):** The minimum voltage level at the output when the input represents a logic high. Ideally, this is 0V or Ground.\n*   **VIL (Input Low Voltage):** The maximum input voltage that is reliably recognized as a logic '0'.\n*   **VIH (Input High Voltage):** The minimum input voltage that is reliably recognized as a logic '1'.\n*   **Switching Threshold (VM):** The point on the curve where `Vin = Vout`. This is the theoretical point where the inverter switches state.\n\nThe points `VIL` and `VIH` are formally defined as the points on the VTC where the slope (gain) is equal to -1 (`dVout / dVin = -1`). The region between `VIL` and `VIH` is the transition region, which is typically designed to be as narrow as possible for a sharp switching characteristic.\n\n## Transistor Operating Regions\n\nThe shape of the VTC curve is determined by the operating state of the NMOS (driver) and PMOS (load) transistors.\n\n1.  **Cutoff Region (Driver NMOS):** When `Vin` is low (close to 0V), the driver NMOS transistor is in cutoff (off). The load transistor (in this case, a PMOS) is in its linear region, pulling the output `Vout` up to `VDD`.\n2.  **Saturation Region (Driver NMOS):** As `Vin` increases and crosses the NMOS threshold voltage, the NMOS transistor turns on and enters the saturation region. The inverter acts as an amplifier in this region, exhibiting high gain. This is the steep transition part of the curve.\n3.  **Linear Region (Driver NMOS):** As `Vin` approaches `VDD`, the driver NMOS transistor is fully on and enters its linear (or triode) region. It acts like a closed switch, pulling the output `Vout` down to ground.\n\n# CMOS Inverter\n\nCMOS stands for **Complementary Metal-Oxide Semiconductor**. It is the dominant technology for constructing integrated circuits. A CMOS inverter is the most fundamental CMOS logic gate and forms the basis for more complex logic circuits.\n\n![Circuit diagram of a CMOS Inverter](images/figure_2.png)\n\n## Circuit Structure & Operation\n\nA CMOS inverter consists of two complementary transistors connected in series between the power supply (`VDD`) and ground (`gnd`):\n\n*   A **PMOS** transistor (the 'load' or 'pull-up' device) connected to `VDD`.\n*   An **NMOS** transistor (the 'driver' or 'pull-down' device) connected to `gnd`.\n\nThe gates of both transistors are tied together to form the input, and their drains are tied together to form the output.\n\nThe key to CMOS operation is the complementary nature of the transistors. For any given input, one transistor is ON while the other is OFF.\n\n*   **PMOS Transistor:** Has a negative threshold voltage (`VTp`). It turns ON when its gate-to-source voltage (`VGSp`) is negative (i.e., when the input is LOW).\n*   **NMOS Transistor:** Has a positive threshold voltage (`VTn`). It turns ON when its gate-to-source voltage (`VGSn`) is positive (i.e., when the input is HIGH).\n\n## Summary of Transistor States\n\nThis complementary behavior can be summarized as follows, treating the ON state as a short circuit (S.C.) and the OFF state as an open circuit (O.C.).\n\n### For PMOS (Pull-up)\n*   If Input = 0 (LOW), then the PMOS is **ON** (Source to Drain ≈ Short Circuit). `Vout` is pulled to `VDD`.\n*   If Input = 1 (HIGH), then the PMOS is **OFF** (Source to Drain ≈ Open Circuit).\n\n### For NMOS (Pull-down)\n*   If Input = 0 (LOW), then the NMOS is **OFF** (Drain to Source ≈ Open Circuit).\n*   If Input = 1 (HIGH), then the NMOS is **ON** (Drain to Source ≈ Short Circuit). `Vout` is pulled to `gnd`."
    },
    {
      "image": "3.png",
      "description": "# CMOS Inverter: Voltage Transfer Characteristic (VTC) Analysis\n\n## Introduction\nThe CMOS (Complementary Metal-Oxide-Semiconductor) inverter is a fundamental building block in digital logic circuits. It consists of a PMOS (P-type MOS) and an NMOS (N-type MOS) transistor connected in series between the power supply (`VDD`) and ground (`GND`). This document analyzes the DC behavior of the inverter by examining its Voltage Transfer Characteristic (VTC), which plots the output voltage (`Vout`) as a function of the input voltage (`Vin`).\n\n## Voltage Definitions\nTo understand the inverter's operation, we must define the key voltages for both transistors. The input voltage `Vin` is applied to the gates of both transistors, and the output `Vout` is taken from their connected drains.\n\n### NMOS Transistor (n)\n*   **Source:** Connected to Ground, so `VS = 0`.\n*   **Gate-to-Source Voltage:** `VGSn = VG - VS = Vin - 0 = Vin`\n*   **Drain-to-Source Voltage:** `VDSn = VD - VS = Vout - 0 = Vout`\n*   **Threshold Voltage:** `VTn` is a positive value (`+ve`).\n\n### PMOS Transistor (p)\n*   **Source:** Connected to the power supply, so `VS = VDD`.\n*   **Gate-to-Source Voltage:** `VGSp = VG - VS = Vin - VDD`\n*   **Drain-to-Source Voltage:** `VDSp = VD - VS = Vout - VDD`\n*   **Threshold Voltage:** `VTp` is a negative value (`-ve`).\n\n## Transistor Operating Regions\nThe behavior of each transistor, and thus the inverter, is determined by its operating region: cut-off, linear (or triode), or saturation. The conditions for each region are summarized below.\n\n| Region     | NMOS Condition                                | PMOS Condition                                 |\n|------------|-----------------------------------------------|------------------------------------------------|\n| **Cut-off**  | `VGSn < VTn`                                  | `VGSp > VTp`                                   |\n| **Linear**   | `VGSn > VTn` and `VDSn < VGSn - VTn`          | `VGSp < VTp` and `VDSp > VGSp - VTp`           |\n| **Saturation**| `VGSn > VTn` and `VDSn > VGSn - VTn`          | `VGSp < VTp` and `VDSp < VGSp - VTp`           |\n\n\n## Voltage Transfer Characteristic (VTC)\nThe VTC curve illustrates how `Vout` changes as `Vin` sweeps from 0 to `VDD`. The curve is divided into five distinct regions based on the operating states of the NMOS and PMOS transistors.\n\n![Voltage Transfer Characteristic (VTC) of a CMOS Inverter showing operating regions](images/figure_1.png)\n\n### Analysis of Operating Regions\n\n*   **Region A: NMOS Cut-off** (`0 <= Vin < VTn`)\n    *   **NMOS:** In **cut-off**, acting as an open switch.\n    *   **PMOS:** In the **linear** region, acting as a closed switch to VDD.\n    *   **Output:** `Vout = VDD`.\n\n*   **Region B: NMOS Saturation, PMOS Linear** (`VTn <= Vin < VDD/2`)\n    *   **NMOS:** Turns on and enters the **saturation** region.\n    *   **PMOS:** Remains in the **linear** region.\n    *   **Output:** `Vout` begins to drop as `Vin` increases because the NMOS transistor starts conducting current.\n\n*   **Region C: Both Transistors in Saturation** (`Vin ≈ VDD/2`)\n    *   **NMOS:** In **saturation**.\n    *   **PMOS:** Also in **saturation**.\n    *   **Output:** This is the high-gain transition region. A small change in `Vin` causes a large, sharp drop in `Vout`.\n\n*   **Region D: NMOS Linear, PMOS Saturation** (`VDD/2 < Vin <= VDD + VTp`)\n    *   **NMOS:** Moves into the **linear** region.\n    *   **PMOS:** Remains in the **saturation** region.\n    *   **Output:** `Vout` continues to fall, but the slope of the curve becomes less steep.\n\n*   **Region E: PMOS Cut-off** (`Vin > VDD + VTp`)\n    *   **NMOS:** In the **linear** region, acting as a closed switch to ground.\n    *   **PMOS:** Enters the **cut-off** region, acting as an open switch.\n    *   **Output:** `Vout = 0`."
    },
    {
      "image": "4.png",
      "description": "# CMOS Transistor Sizing and Power Dissipation\n\nThis document covers two fundamental concepts in CMOS VLSI design: why PMOS transistors are sized larger than NMOS transistors in typical digital circuits, and the nature of switching (or dynamic) power dissipation.\n\n## Why PMOS Area is Greater Than NMOS\n\nIn digital CMOS logic gates, it is often desirable to have symmetric rise and fall times for the output signal. This ensures predictable timing and a consistent response regardless of whether the output is transitioning from low-to-high or high-to-low. The primary reason a PMOS transistor needs a larger area (specifically, a wider channel) than an NMOS transistor to achieve this symmetry is due to the difference in charge carrier mobility.\n\n*   **Charge Carrier Mobility:** The charge carriers in an NMOS transistor are electrons (e⁻), while the charge carriers in a PMOS transistor are holes. The mobility of electrons (`μn`) is significantly higher than the mobility of holes (`μp`). Typically, electron mobility is about 2.5 to 3 times higher than hole mobility.\n    \n    `μn ≈ (2.5 to 3) * μp`\n\n### Sizing Derivation\n\nTo achieve symmetric switching characteristics, the current-driving capabilities of the pull-up (PMOS) and pull-down (NMOS) networks must be equal. This can be achieved by making their transconductance parameters (`kn` and `kp`) approximately equal.\n\nThe transconductance parameter `k` is defined as:\n\n`k = μ * Cox * (W/L)`\n\nWhere:\n*   `μ` is the carrier mobility (`μn` for NMOS, `μp` for PMOS).\n*   `Cox` is the gate oxide capacitance per unit area, which is the same for both transistor types in a given manufacturing process.\n*   `W/L` is the aspect ratio of the transistor channel (Width / Length).\n\nTo have symmetric performance, we set the drive strengths to be equal. For an inverter, this means `kn = kp`.\n\n`kn = kp`\n\n`μn * Cox * (W/L)n = μp * Cox * (W/L)p`\n\nSince `Cox` is constant for both devices, it can be canceled out:\n\n`μn * (W/L)n = μp * (W/L)p`\n\nRearranging the equation to solve for the ratio of their aspect ratios, we get:\n\n`(W/L)p / (W/L)n = μn / μp`\n\nGiven that `μn / μp ≈ 2.5` to `3`, it follows that:\n\n`(W/L)p ≈ (2.5 to 3) * (W/L)n`\n\nThis result shows that to compensate for the lower mobility of holes, the width-to-length ratio of the PMOS transistor must be 2.5 to 3 times larger than that of the NMOS transistor. Since the channel length `L` is typically kept at the minimum possible for a given technology node to maximize performance, the channel width `W` of the PMOS device must be made significantly larger. A larger channel width directly translates to a larger physical area on the silicon wafer.\n\n## Switching Power Dissipation\n\nSwitching power dissipation, also known as **Dynamic Power Dissipation**, is a major component of power consumption in CMOS circuits. This form of power dissipation occurs only when the logic gates are actively switching states (i.e., transitioning from 0 to 1 or 1 to 0).\n\n![A CMOS inverter schematic and its equivalent block diagram representation.](images/figure_1.png)\n\nThis dissipation arises from the energy required to charge and discharge the parasitic and load capacitances present at the output of a logic gate. Every node in a circuit has some capacitance (`CL`), which is a combination of the input gate capacitance of the next stage, the interconnect (wire) capacitance, and the drain diffusion capacitance of the driving gate itself.\n\n### The Charging and Discharging Cycle\n\nConsider the CMOS inverter shown in the diagram:\n\n1.  **Charging (Output Low to High):** When the input `Vin` is low (`0V`), the NMOS transistor (`M2`) is OFF and the PMOS transistor (`M1`) is ON. This creates a path from the power supply (`VDD`) to the output node `Vout`, charging the load capacitor `CL` up to `VDD`. During this process, energy is drawn from the power supply.\n\n2.  **Discharging (Output High to Low):** When the input `Vin` is high (`VDD`), the PMOS (`M1`) turns OFF and the NMOS (`M2`) turns ON. This creates a path from the output node `Vout` to ground, discharging the capacitor `CL` to `0V`. The energy that was stored in the capacitor is dissipated as heat in the NMOS transistor.\n\n### Energy and Power Calculation\n\nThe total energy drawn from the power supply during one full switching cycle (one charge and one discharge) is what contributes to dynamic power dissipation.\n\nThe energy `E_C` stored in the capacitor when it is charged to `VDD` is:\n`E_C = (1/2) * CL * VDD²`\n\nHowever, the total energy `E_VDD` drawn from the power supply to charge the capacitor is:\n`E_VDD = CL * VDD²`\n\nThis is because half the energy is stored in the capacitor, and the other half is dissipated as heat in the PMOS transistor's channel resistance during the charging process. The stored energy is later dissipated in the NMOS during discharge. Therefore, for every low-to-high transition of the output, an energy of `CL * VDD²` is consumed from the supply.\n\nThe dynamic power `P_dynamic` is this energy per cycle multiplied by the frequency of switching `f`:\n\n`P_dynamic = α * CL * VDD² * f`\n\nWhere:\n*   `α` is the **activity factor**, representing the probability that a power-consuming transition occurs during a clock cycle (e.g., for a clock signal itself, `α = 1`).\n*   `CL` is the total load capacitance.\n*   `VDD` is the supply voltage.\n*   `f` is the switching frequency."
    },
    {
      "image": "5.png",
      "description": "# Energy Analysis of Capacitor Charging in Digital Circuits\n\nThis document details the derivation of the energy drawn from a power supply (VDD) to charge a load capacitor (CL). This is a fundamental concept in understanding power dissipation in CMOS digital circuits.\n\n## Circuit Model and Setup\n\nWe begin with a simplified model for the charging phase of a digital gate's output. The output is modeled as a load capacitor, `CL`, which is charged through a resistive element, `R_mos` (representing the on-resistance of the PMOS transistor), from the power supply `VDD`.\n\n![Simplified circuit model for charging a load capacitor.](images/figure_1.png)\n\nThe capacitor `CL` charges from an initial voltage of 0V to a final voltage of `VDD`.\n\n## Derivation of Energy Supplied by VDD\n\nThe total energy, `E_VDD`, supplied by the voltage source is the integral of the instantaneous power, `P(t)`, delivered by the source over the charging period.\n\n![A graph showing that energy is the area under the power vs. time curve.](images/figure_2.png)\n\n1.  **Energy Definition:**\n    The energy is the integral of power with respect to time.\n    ```\n    E_VDD = ∫ P(t) dt\n    ```\n\n2.  **Instantaneous Power:**\n    The instantaneous power supplied by the constant voltage source `VDD` is the product of the voltage and the instantaneous current `i_D(t)` flowing from it.\n    ```\n    P(t) = VDD * i_D(t)\n    ```\n\n3.  **Substituting Power into Energy Equation:**\n    ```\n    E_VDD = ∫ VDD * i_D(t) dt\n    ```\n    Here, `VDD` is a constant and can be taken outside the integral.\n\n4.  **Relating Source Current to Capacitor Current:**\n    The current `i_D(t)` from the source is the same current that charges the capacitor, `i_C(t)`.\n    ```\n    i_D(t) = i_C(t)\n    ```\n    The current through a capacitor is given by the formula `i_C = C * (dV/dt)`. In our case, this is:\n    ```\n    i_C(t) = C_L * (dVo/dt)\n    ```\n    where `Vo` is the output voltage across the capacitor.\n\n5.  **Changing the Variable of Integration:**\n    We substitute the expression for `i_D(t)` into the energy integral:\n    ```\n    E_VDD = ∫ VDD * (C_L * dVo/dt) dt\n    ```\n    The `dt` terms cancel, allowing us to change the variable of integration from time `t` to output voltage `Vo`. The limits of integration change accordingly, as the voltage `Vo` goes from 0 to `VDD`.\n    ```\n    E_VDD = ∫[from 0 to VDD] VDD * C_L dVo\n    ```\n\n6.  **Solving the Integral:**\n    Since `VDD` and `C_L` are constants, we can pull them out of the integral.\n    ```\n    E_VDD = VDD * C_L ∫[from 0 to VDD] dVo\n    ```\n    The integral of `dVo` is simply `Vo`. Evaluating this at the limits:\n    ```\n    E_VDD = VDD * C_L * [Vo]_[from 0 to VDD]\n    E_VDD = VDD * C_L * (VDD - 0)\n    ```\n\n7.  **Final Result:**\n    The total energy supplied by the power source to charge the capacitor is:\n    ```\n    E_VDD = C_L * VDD^2\n    ```\n\n## Energy Stored in the Capacitor\n\nIt is important to distinguish the energy *supplied by the source* from the energy *stored in the capacitor*. The standard formula for the energy stored in a capacitor (`E_CL`) when charged to a voltage `VDD` is:\n\n```\nE_CL = (1/2) * C_L * VDD^2\n```\n\n## Conclusion: Energy Dissipation\n\nBy comparing the two results, we see a crucial outcome:\n\n*   **Energy Supplied:** `E_VDD = C_L * VDD^2`\n*   **Energy Stored:** `E_CL = (1/2) * C_L * VDD^2`\n\nThis shows that **only half of the energy drawn from the power supply is actually stored in the load capacitor.** The other half (`E_VDD - E_CL = (1/2) * C_L * VDD^2`) is dissipated as heat in the charging path, primarily through the resistive component `R_mos` of the PMOS transistor. This phenomenon is a key contributor to the dynamic power dissipation in CMOS logic circuits."
    },
    {
      "image": "6.png",
      "description": "# Dynamic Power Dissipation in CMOS Circuits\n\nThis document outlines the derivation of dynamic power dissipation in CMOS circuits, focusing on the energy consumed during the charging and discharging of the load capacitor, `C_L`.\n\n## 1. Energy Stored in the Load Capacitor\n\nWhen the output of a CMOS gate transitions from low to high, the load capacitor `C_L` is charged from 0V to the supply voltage `V_DD`. The energy stored in the capacitor (`E_C`) during this process can be calculated as follows.\n\nThe energy is the integral of power over time, where power is `P = V * I`. For a capacitor, the current `I` is `C_L * (dV/dt)`.\n\n*   The initial formula for energy is:\n    `E_C = ∫ V_o * C_L * (dV_o / dt) * dt`\n*   Simplifying by canceling the `dt` terms and changing the integration limits from time (0 to T) to voltage (0 to `V_DD`):\n    `E_C = C_L * ∫(from 0 to V_DD) V_o dV_o`\n*   Performing the integration:\n    `E_C = C_L * [V_o^2 / 2]` evaluated from 0 to `V_DD`.\n*   This yields the final expression for the total energy stored in the fully charged capacitor:\n    `E_C = (1/2) * C_L * V_DD^2`\n\n## 2. Power Dissipation Across the PMOS Pull-Up Network\n\nDuring the charging phase (a low-to-high output transition), the PMOS transistor in the pull-up network is ON, connecting the load capacitor to the `V_DD` supply. Not all the energy drawn from the supply is stored in the capacitor; a portion is dissipated as heat in the PMOS transistor.\n\n*   The total energy drawn from the supply (`E_VDD`) to charge the capacitor is `E_VDD = Q_total * V_DD = (C_L * V_DD) * V_DD = C_L * V_DD^2`.\n*   The energy dissipated in the PMOS network is the difference between the energy supplied and the energy stored:\n    `E_diss_PMOS = E_VDD - E_C`\n*   Substituting the known values:\n    `E_diss_PMOS = C_L * V_DD^2 - (1/2) * C_L * V_DD^2`\n*   Therefore, the energy dissipated as heat in the pull-up network is:\n    `E_diss_PMOS = (1/2) * C_L * V_DD^2`\n\nThis key result shows that during charging, exactly half of the energy drawn from the supply is stored in the capacitor, and the other half is dissipated by the PMOS transistor.\n\n## 3. Power Dissipation Across the NMOS Pull-Down Network\n\nDuring the discharging phase (a high-to-low output transition), the input `V_in` is high (e.g., `5V` or `logic 1`). This turns the NMOS transistor (in the pull-down network) ON and the PMOS transistor OFF.\n\n![A diagram showing the discharging of the load capacitor through the NMOS transistor's on-resistance.](images/figure_1.png)\n\nThe energy that was previously stored in the load capacitor, `E_C = (1/2) * C_L * V_DD^2`, is now discharged to ground through the conducting NMOS transistor.\n\n*   This entire stored energy is converted into heat within the NMOS transistor, which has a finite on-resistance represented as `R_dn`.\n*   Therefore, the energy dissipated in the pull-down network (labeled `P_d_nmos` in the notes, representing energy dissipation `E_diss_NMOS`) is:\n    `E_diss_NMOS = (1/2) * C_L * V_DD^2`\n\nIn conclusion, for one complete charge/discharge cycle, the total energy dissipated is the sum of the dissipation in the PMOS and NMOS networks, which totals `C_L * V_DD^2`."
    }
  ],
  "image_prompts": [
    "A clean electronic schematic diagram of a Depletion Load nMOS Inverter. The diagram shows two n-channel MOSFETs stacked vertically between VDD and ground. The top transistor is a depletion-mode nMOS labeled 'load nMOS', indicated by a solid, thick channel line. Its gate is connected to its source. Its drain is connected to a power rail labeled 'VDD'. Its source is connected to the output node. The bottom transistor is an enhancement-mode nMOS labeled 'driver nMOS', indicated by a dashed channel line. Its gate is connected to the input signal, labeled 'Vin'. Its drain is connected to the output node. Its source is connected to a ground symbol. The output node between the two transistors is labeled 'Vout'. Annotations next to the load transistor read 'Vgs(load) = 0' and 'Vt(load) < 0 (-ve)'. An arrow points from the load transistor to text that reads 'always remains in ON condition'. A horizontal line segment to the right of Vout is divided and labeled 'linear' on the left and 'saturation' on the right.",
    "A simplified, hand-drawn style schematic representing the OFF state of an nMOS inverter. At the top is the label 'VDD'. Below it is a non-linear resistor symbol (a zig-zag line) connected to an output node labeled 'Vout'. This resistor is labeled 'non-linear resistance'. Below the Vout node is an open switch, representing the driver transistor. The switch is connected to a ground symbol. An input signal labeled 'Vin' points to the control of the switch. Text to the left of the switch reads 'Case 1: logic(0)' and 'OFF'. To the right of the circuit, the text reads 'Vout = VDD (high)'. Below this, additional text explains: 'VDD fully transfers to Vout since driver nMOS is O.C.'.",
    "A simplified, hand-drawn style schematic representing the ON state of an nMOS inverter. At the top is the label 'VDD'. Below it is a non-linear resistor symbol (a zig-zag line) connected to an output node labeled 'Vout'. Below the Vout node is a closed switch, representing the driver transistor, creating a direct connection to a ground symbol. An input signal labeled 'Vin' points to the control of the switch. Text to the left of the switch reads 'Case 2: logic(1)' and 'ON'. To the right of the circuit, the text reads 'Vout = 0 (low)'.",
    "A hand-drawn style graph of a Voltage Transfer Characteristic (VTC) curve for an inverter. The plot is on a lined paper background. The vertical axis is labeled 'Vout' and the horizontal axis is labeled 'Vin'. The y-axis starts at 0 and goes up to a point labeled '(VOH) VDD'. The x-axis starts at 0 and has points marked in increasing order: 'VIL', 'VIH', and 'VDD'. Below the x-axis, the region from 0 to VIL is labeled 'Logic 0', and the region from VIH to VDD is labeled 'Logic 1'. The curve is a smooth, inverted S-shape, starting at (0, VDD) and ending near (VDD, 0). There are several annotations pointing to the curve: The top, nearly horizontal part is labeled 'Cutoff (driver NMOS)' and 'linear region for load NMOS'. The middle, steep section is labeled 'Saturation region for driver NMOS'. The bottom, nearly horizontal section is labeled 'linear region of driver NMOS'. Two dotted tangent lines are drawn on the curve at the points corresponding to VIL and VIH, with each tangent labeled 'dVout/dVin = -1'. Another label on the steepest part of the curve indicates 'dVout/dVin'.",
    "A hand-drawn schematic of a CMOS inverter circuit on a lined paper background. The circuit consists of a PMOS transistor on top and an NMOS transistor on the bottom. The PMOS transistor symbol includes a circle at its gate. The source of the PMOS is connected to a line labeled 'VDD'. The source of the NMOS is connected to a ground symbol labeled 'gnd'. The gates of both transistors are connected together, forming the input terminal, labeled 'I/P'. A small square wave is drawn next to the input line. The drains of both transistors are connected together, forming the output terminal, labeled 'O/P'. The top transistor is labeled 'Load (PMOS)' and the bottom is labeled 'Driver (NMOS)'. Various voltage labels are included: 'VGSp' between the PMOS gate and source, 'VDSn' across the NMOS drain and source. An arrow points from the PMOS device to the text 'VTp = -ve'. An arrow points from the NMOS device to the text 'VTn = +ve'. Another arrow from the PMOS points to a note saying 'for PMOS Vth is -ve'.",
    "A clear, educational diagram in a hand-drawn style on a white, lined notebook paper background, illustrating the Voltage Transfer Characteristic (VTC) of a CMOS inverter. Use a thick blue pen for the main VTC curve and a black pen for the axes and all text annotations. The horizontal x-axis is labeled at the far right as 'Vin'. Tick marks along the x-axis are labeled, from left to right: '0', 'VTn', 'VDD/2', 'VDD + VTp', and 'VDD'. The vertical y-axis originates at (0,0) and has tick marks labeled 'VDD/2' and 'VDD'. A tick mark below the origin on the y-axis is labeled '-VTp'. The VTC curve is a steep, inverted S-shape. It begins at the coordinate (0, VDD), passes through (VDD/2, VDD/2) during its sharp descent, and ends at (VDD, 0). Annotations describe the state of the transistors in different regions along the curve: On the top, flat part of the curve, it is labeled 'PMOS (linear)' and 'NMOS (cut-off)'. On the upper section of the steep slope, it is labeled 'NMOS (Sat)'. An arrow pointing to this region is labeled 'B(SATURATION) NMOS'. In the middle of the steep slope, two arrows point to the curve, labeled 'PMOS (Sat)' and 'NMOS (Sat)'. A nearby note says 'Both like parallel'. On the lower section of the steep slope, another arrow points to the curve, labeled 'PMOS (Sat)'. On the bottom, flat part of the curve, it is labeled 'NMOS (linear)'. Two faint, dashed lines indicate the boundaries of the saturation regions. One line shows 'Vout = Vin - VTn'. The other shows 'Vout = Vin + VTp'. The VTC curve is contained between these lines.",
    "A composite technical illustration showing two related diagrams side-by-side on a white background, drawn with clean black lines in a textbook style. On the left is a detailed CMOS inverter circuit schematic. This schematic includes a PMOS transistor labeled 'PMOS M₁' at the top and an NMOS transistor labeled 'NMOS M₂' at the bottom. The PMOS has a small circle on its gate terminal. The source of the PMOS (labeled S₁) is connected to a power rail labeled 'VDD'. The source of the NMOS (labeled S₂) is connected to a ground symbol. The gates of both transistors (labeled G₁ and G₂) are tied together and connected to the input node labeled 'Vin'. To the left of 'Vin', a small icon of a square wave is drawn. The drains of both transistors (labeled D₁ and D₂) are tied together to form the output node 'Vout'. A load capacitor labeled 'Cₗ' is connected between 'Vout' and a ground symbol. On the right is a simplified block diagram representation of the same circuit. It shows a rectangular box labeled 'Pull up network' with 'M₁' written beside it, connected between 'VDD' and 'Vout'. Below it, another rectangular box labeled 'Pull down network' with 'M₂' written beside it is connected between 'Vout' and a ground symbol. A capacitor labeled 'Cₗ' is also shown connected between 'Vout' and ground. A horizontal arrow points from the 'Vout' node of the left schematic towards the right block diagram, indicating they are equivalent representations.",
    "A clean, black and white electronic schematic diagram illustrating the charging of a load capacitor. At the top, a horizontal line represents the power supply, labeled 'VDD'. A resistor symbol is connected vertically from VDD, labeled 'R_mos', representing the on-resistance of a MOS transistor. An arrow pointing downwards along this path is labeled 'i_D(t)'. The node between the resistor and the capacitor is labeled 'V_out'. A capacitor symbol is connected from the 'V_out' node to a ground symbol at the bottom. The capacitor is labeled 'C_L'. An annotation next to the V_out node states '0 to VDD', indicating the voltage swing during charging.",
    "A simple, hand-drawn style 2D graph on a white background with a coordinate system. The vertical axis is labeled 'P' representing Power, and the horizontal axis is labeled 't' representing Time. An arbitrary, non-linear curve is plotted on the graph, showing power varying over time. Two distinct points on the horizontal axis are marked as 't1' and 't2'. The area under the curve between t1 and t2 is shaded with diagonal lines. A label 'E' (for Energy) has an arrow pointing to this shaded area, visually illustrating the concept that energy is the integral of power with respect to time.",
    "A simple, clean schematic diagram in a hand-drawn notebook style with black ink on a white background. The diagram illustrates the discharge of a capacitor through a resistor. On the right, there is a two-plate capacitor symbol connected between a horizontal wire and a ground symbol. The capacitor is labeled with the text '(1/2) * C_L * V_DD^2' to indicate its stored energy. On the left, a resistor symbol is connected vertically between the same horizontal wire and another ground symbol. The resistor is labeled 'R_dn', representing the pull-down network resistance. A curved arrow originates from the horizontal wire above the resistor, swoops down, and points to the resistor, indicating the path of discharge current. All labels and symbols should be clear and legible, resembling neat engineering handwriting."
  ]
}